1s/ERP/Conf/Documents/Лико_ПрочиеЗатраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ПрочиеЗатраты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Лико_СебестоимостьЗаказов</xr:Item>
				<xr:Item>AccumulationRegister.Лико_ЗатратыПоЗаказу</xr:Item>
				<xr:Item>AccumulationRegister.Лико_ЗатратыНаПродажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>План</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Факт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выпуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗатратыКРаспределению</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Площадка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Менеджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочийЦентр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПроката</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПродажи</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочийЦентр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПроката</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нормочасы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выручка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ПрочиеЗатраты/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьПоВыручкеНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПрочиеЗатратыЗатратыКРаспределению.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.РабочийЦентр КАК РабочийЦентр,
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры КАК Заказ,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК СуммаВыручки,
	|	Лико_ПрочиеЗатратыЗатратыКРаспределению.Сумма КАК Сумма,
	|	Лико_ПрочиеЗатратыЗатратыКРаспределению.СуммаПлан КАК СуммаПлан,
	|	ВыручкаИСебестоимостьПродажОбороты.Период КАК Период,
	|	ВЫБОР
	|		КОГДА Лико_ПрочиеЗатратыЗатратыКРаспределению.СтатьяЗатрат.УчитыватьВВыпуске
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Регистратор
	|	КОНЕЦ КАК ДокументПродажи
	|ПОМЕСТИТЬ ВТВыручка
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.РабочийЦентр.Лико_ОсновнаяМашина) КАК ВыручкаИСебестоимостьПродажОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_ПрочиеЗатраты.ЗатратыКРаспределению КАК Лико_ПрочиеЗатратыЗатратыКРаспределению
	|		ПО (ВЫБОР
	|				КОГДА Лико_ПрочиеЗатратыЗатратыКРаспределению.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Лико_ПрочиеЗатратыЗатратыКРаспределению.Партнер = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА Лико_ПрочиеЗатратыЗатратыКРаспределению.Менеджер = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Лико_ПрочиеЗатратыЗатратыКРаспределению.Менеджер = ВыручкаИСебестоимостьПродажОбороты.Менеджер
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА Лико_ПрочиеЗатратыЗатратыКРаспределению.Площадка = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Лико_ПрочиеЗатратыЗатратыКРаспределению.Площадка = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Договор.Лико_Площадка
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА Лико_ПрочиеЗатратыЗатратыКРаспределению.РабочийЦентр = ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Лико_ПрочиеЗатратыЗатратыКРаспределению.РабочийЦентр = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.РабочийЦентр
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА Лико_ПрочиеЗатратыЗатратыКРаспределению.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Лико_ПрочиеЗатратыЗатратыКРаспределению.Заказ = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры
	|			КОНЕЦ)
	|ГДЕ
	|	Лико_ПрочиеЗатратыЗатратыКРаспределению.Ссылка = &ссылка
	|	И ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ПрочиеЗатратыЗатратыКРаспределению.СтатьяЗатрат,
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.РабочийЦентр,
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры,
	|	Лико_ПрочиеЗатратыЗатратыКРаспределению.Сумма,
	|	Лико_ПрочиеЗатратыЗатратыКРаспределению.СуммаПлан,
	|	ВыручкаИСебестоимостьПродажОбороты.Период,
	|	ВЫБОР
	|		КОГДА Лико_ПрочиеЗатратыЗатратыКРаспределению.СтатьяЗатрат.УчитыватьВВыпуске
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Регистратор
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТВыручка.СуммаВыручки) КАК СуммаВыручки
	|ПОМЕСТИТЬ ИтогоВыручка
	|ИЗ
	|	ВТВыручка КАК ВТВыручка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТВыручка.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВТВыручка.РабочийЦентр КАК РабочийЦентр,
	|	ВТВыручка.Заказ КАК Заказ,
	|	1 КАК НомерПроката,
	|	ВТВыручка.ДокументПродажи КАК ДокументПродажи,
	|	ВТВыручка.Сумма / ИтогоВыручка.СуммаВыручки * ВТВыручка.СуммаВыручки КАК Сумма,
	|	ВТВыручка.СуммаПлан / ИтогоВыручка.СуммаВыручки * ВТВыручка.СуммаВыручки КАК СуммаПлан,
	|	ДОБАВИТЬКДАТЕ(ВТВыручка.Период, СЕКУНДА, -1) КАК Период,
	|	ВТВыручка.СуммаВыручки КАК Выручка
	|ИЗ
	|	ВТВыручка КАК ВТВыручка,
	|	ИтогоВыручка КАК ИтогоВыручка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период"  ;
	Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Объект.ДатаОкончания);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Объект.Затраты.Очистить();
	Объект.затраты.Загрузить(Запрос.Выполнить().Выгрузить());	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоВыручке(Команда)
	ЗаполнитьПоВыручкеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
